---
type: ModelPath
namespace: Autodesk.Revit.DB
version: 2024
members: 10
tags: [revit-api, class]
---

# ModelPath

`Autodesk.Revit.DB.ModelPath` · Revit 2024 · 10 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | Compare | 2012 | `public int Compare ( ModelPath otherPath )` |
| Method | Dispose | — | `public void Dispose ()` |
| Method | GetModelGUID | 2012 | `public Guid GetModelGUID ()` |
| Method | GetProjectGUID | 2012 | `public Guid GetProjectGUID ()` |
| Property | CentralServerPath | 2012 | `public string CentralServerPath { get ; }` |
| Property | CloudPath | 2019 | `public bool CloudPath { get ; }` |
| Property | Empty | 2015 | `public bool Empty { get ; }` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |
| Property | Region | 2021 | `public string Region { get ; }` |
| Property | ServerPath | 2012 | `public bool ServerPath { get ; }` |